# 0. Басюк
# 1. Загиней
# 2. Радчук
# 3. Рахильчук
# 4. Семенюк

#Скласти програму мовою python для реалізаці наступних завдань.
# 0.     Напишіть і перевірте роботу функції F1(string), яка створює та повертає рядок, що складається з малих літер рядка, переданого як аргумент, але у зворотному порядку їх появи, наприклад, для рядка: 'Ala ma Kota" функція повертає: "atoamal"
# 1.     Напишіть і протестуйте роботу функції F2(string), яка друкуватиме лише великі літери алфавіту, що містяться в рядку, переданому як аргумент функції.
# 2.     Напишіть і перевірте роботу функції F3(string), яка підраховуватиме та повертатиме кількість символів, окрім букв алфавіту (незалежно від регістру), у рядку, переданому як аргумент функції.
# 3.     Напишіть і протестуйте роботу функції F4(string), яка повертатиме символ, який найчастіше зустрічається в рядку, переданому як аргумент функції.
# 4.     Напишіть і перевірте роботу функції F5(string1, string2), яка порівнюватиме два рядки, передані як аргументи функції, і повертатиме значення True, якщо це однакові рядки, і False в іншому випадку.
# 5. Напишіть і перевірте роботу функції F7(string), яка поверне рядок, створений об’єднанням двох рядків, які є аргументами функції, таким чином, щоб він містив не буквено-цифрові символи.
# 0. F10(L, K), яка перевірить і поверне True, якщо списки L і K мають однакову кількість і однакові елементи, False в іншому випадку.
# 1. F1(L), яка перевірить і поверне кількість парних чисел у списку L, переданому як аргумент функції.
# 2. F2(L), яка перевірить і виведе на екран, скільки разів кожна цифра з’являється в списку L (для цього використовуйте допоміжний список, індекси якого представляють цифри, а значення представляють кількість їх входжень).
# 3. F3(L), яка обчислить і поверне середнє арифметичне елементів списку L.
# 4. F4(L), яка знайде найменший елемент у списку L і поверне останній індекс, за яким знаходиться цей елемент і його значення.
#  5. F5(L), яка перевірить і поверне кількість голосних у списку L.
#Оформіть як окремий модуль в окремому пакеті.
#Продемнструйте використання описаних функцій у файлі using_fuc_from_module.py

#======================Radchuk==========================

import packegeRadchuk.myfunc21 as RadF
RadF.myfunc()